src/main/resources/META-INF/debug/data.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oth="http://other.service.ws.channel.component.yitong.com.cn/">
   <soapenv:Header/>
   <soapenv:Body>
      <oth:queryyt0001>
         <!--Optional:-->
         <sysHead>
            <!--Optional:-->
           
            <!--Optional:-->
            <senderSrvName>custInfo</senderSrvName>
            <!--Optional:-->
            <senderSubsysName>YDCRM01</senderSubsysName>
            <!--Optional:-->
            <senderSubsysNode>YDCRM01</senderSubsysNode>
            <!--Optional:-->
            <senderSysName>YDCRM</senderSysName>
         </sysHead>
         <!--Optional:-->
         <commDomain>
            <!--Optional:-->
            <channelCode></channelCode>
            <!--Optional:-->
            <tellerNo></tellerNo>
            <!--Optional:-->
            <transDate></transDate>
            <!--Optional:-->
            <transInstNo></transInstNo>
            <!--Optional:-->
            <transRespCode></transRespCode>
            <!--Optional:-->
            <transRespDesc></transRespDesc>
            <!--Optional:-->
            <transRespDescLen></transRespDescLen>
            <!--Optional:-->
            <transSerialNo></transSerialNo>
            <!--Optional:-->
            <transTime></transTime>
         </commDomain>
         <!--Optional:-->
         <body>
            <!--Optional:-->
            <kpiOrg>816010808</kpiOrg>
            <!--Optional:-->
            <txType>1</txType>
         </body>
      </oth:queryyt0001>
   </soapenv:Body>
</soapenv:Envelope>